DELETE FROM user_role;
DELETE FROM users;
DELETE FROM meals;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_role (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (user_id, date_time, description, calories)
VALUES (100000, '2020-01-30 10:00:00', 'Завтрак', 500),
       (100000, '2020-01-30 13:00:00', 'Обед', 1000),
       (100000, '2020-01-30 20:00:00', 'Ужин', 500),
       (100000, '2020-01-31 00:00:00', 'Еда на граничное значение', 100),
       (100000, '2020-01-31 10:00:00', 'Завтрак', 1000),
       (100000, '2020-01-31 13:00:00', 'Обед', 500),
       (100000, '2020-01-31 20:00:00', 'Ужин', 410),
       (100001, '2025-06-14 10:00:00', 'Завтрак админа', 300),
       (100001, '2025-06-14 13:00:00', 'Обед админа', 200),
       (100001, '2025-06-14 20:00:00', 'Ужин админа', 100),
       (100001, '2025-06-15 10:00:00', 'Завтрак админа', 500),
       (100001, '2025-06-15 13:00:00', 'Обед админа', 400),
       (100001, '2025-06-15 20:00:00', 'Ужин админа', 300);
